app/views/messages/_messages.html.erb

				<% elsif !@readable && message.users %>
					<%= message.users.map {|user| user.name}.join(', ') %>
---
SELECT "users".* FROM "users" INNER JOIN "messages_users" ON "users"."id" = "messages_users"."user_id" WHERE "messages_users"."message_id" = $1  [["message_id", 1]]