app/controllers/friend_controller.rb

  def add
    require_login

    email = CGI.unescape params[:email]
    friend = User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "b@b"]]