app/controllers/messages_controller.rb

  def index
    require_login

    @readable = true;

    if params[:id]
      @messages = get_message_per_page(Message.where(id: params[:id]))
    else
      @messages = get_message_per_page(current_user.messages.order(unread: :desc, created_at: :desc))
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 5 OFFSET 0  [["id", 26]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."id" = $1  [["id", 26]]
SELECT  "messages".* FROM "messages" INNER JOIN "messages_users" ON "messages"."id" = "messages_users"."message_id" WHERE "messages_users"."user_id" = $1  ORDER BY "messages"."unread" DESC, "messages"."created_at" DESC LIMIT 5 OFFSET 0  [["user_id", 2]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "messages" INNER JOIN "messages_users" ON "messages"."id" = "messages_users"."message_id" WHERE "messages_users"."user_id" = $1 LIMIT 5 OFFSET 5) subquery_for_count  [["user_id", 1]]

  def create
    data = send_params
    recipients = data[:recipients].map { |recipient| User.where(email: recipient) }
    sender = current_user

    if recipients.presence
      message = Message.new(content: data[:content], images: data[:images], unread: true, sender_id: sender.id)

      if message.save
        message.users << recipients

        MessageMailer.sent_message(message, get_root_path).deliver_later

        flash[:success] = 'Message sent!'
      else
        flash[:error] = message.errors.full_messages.join(', ')
---
SELECT  "users".* FROM "users" WHERE "users"."email" IN ('a@a.com', 'b@b.com', 'c@c.com') LIMIT 1
INSERT INTO "messages" ("content", "unread", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sdfsdfs"], ["unread", "t"], ["sender_id", 2], ["created_at", "2015-12-13 05:46:47.793290"], ["updated_at", "2015-12-13 05:46:47.793290"]]
SELECT "messages".* FROM "messages" INNER JOIN "messages_users" ON "messages"."id" = "messages_users"."message_id" WHERE "messages_users"."message_id" = ?  [["message_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "messages_users" ON "users"."id" = "messages_users"."user_id" WHERE "messages_users"."message_id" = ?  [["message_id", 2]]

  def unread
    json = JSON.parse(request.body.read)
    message = Message.find(json['id'])

    respond_to do |format|
      if message.presence && message.unread && message.update_attributes({ unread: false, read_time: DateTime.now })
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "messages" SET "unread" = ?, "read_time" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["unread", "f"], ["read_time", "2015-12-12 14:38:33.971701"], ["updated_at", "2015-12-12 14:38:33.989951"], ["id", 980190965]]