app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "a@a.com"]]