app/controllers/user_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(request_params)

    respond_to do |format|
      if @user.save